var allCities = [{
        "id": 1,
        "text": "اسطنبول",
        "lat": 41.01,
        "lng": 28.9603
    },
    {
        "id": 2,
        "text": "انقرة",
        "lat": 39.93,
        "lng": 32.85
    },
    {
        "id": 3,
        "text": "ازمير",
        "lat": 38.4127,
        "lng": 27.1384
    },
    {
        "id": 4,
        "text": "بورصة",
        "lat": 40.1833,
        "lng": 29.0667
    },
    {
        "id": 5,
        "text": "أنطاليا",
        "lat": 36.9081,
        "lng": 30.6956
    },
    {
        "id": 6,
        "text": "قونية",
        "lat": 37.8714,
        "lng": 32.4847
    },
    {
        "id": 7,
        "text": "اضنة",
        "lat": 37,
        "lng": 35.325
    },
    {
        "id": 8,
        "text": "غازي عنتاب",
        "lat": 37.0667,
        "lng": 37.3833
    },
    {
        "id": 9,
        "text": "اورفا",
        "lat": 37.1583,
        "lng": 38.7917
    },
    {
        "id": 10,
        "text": "مرسين",
        "lat": 36.8,
        "lng": 34.6167
    },
    {
        "id": 11,
        "text": "ديار بكر",
        "lat": 37.9108,
        "lng": 40.2367
    },
    {
        "id": 12,
        "text": "قيصري",
        "lat": 38.7333,
        "lng": 35.4833
    },
    {
        "id": 13,
        "text": "سامسون",
        "lat": 41.2867,
        "lng": 36.33
    },
    {
        "id": 14,
        "text": "تيكيرداج",
        "lat": 40.9833,
        "lng": 27.5167
    },
    {
        "id": 15,
        "text": "دنيزلي",
        "lat": 37.7731,
        "lng": 29.0878
    },
    {
        "id": 16,
        "text": "إسكي شهير",
        "lat": 39.7767,
        "lng": 30.5206
    },
    {
        "id": 17,
        "text": "ترابزون",
        "lat": 41.005,
        "lng": 39.7225
    },
    {
        "id": 18,
        "text": "أرضروم",
        "lat": 39.9097,
        "lng": 41.2756
    },
    {
        "id": 19,
        "text": "ملاطية",
        "lat": 38.3554,
        "lng": 38.3337
    },
    {
        "id": 20,
        "text": "باتمان",
        "lat": 37.8833,
        "lng": 41.1333
    },
    {
        "id": 21,
        "text": "مرعش",
        "lat": 37.5875,
        "lng": 36.9453
    },
    {
        "id": 22,
        "text": "إلازيغ",
        "lat": 38.6667,
        "lng": 39.2167
    },
    {
        "id": 23,
        "text": "هاتاي",
        "lat": 36.2,
        "lng": 36.15
    },
    {
        "id": 24,
        "text": "سيفاس",
        "lat": 39.75,
        "lng": 37.0167
    },
    {
        "id": 25,
        "text": "كوجلي",
        "lat": 40.7656,
        "lng": 29.9406
    },
    {
        "id": 26,
        "text": "فان",
        "lat": 38.5019,
        "lng": 43.4167
    },
    {
        "id": 27,
        "text": "ترسوس",
        "lat": 36.9167,
        "lng": 34.9
    },
    {
        "id": 28,
        "text": "باليكسير",
        "lat": 39.6511,
        "lng": 27.8842
    },
    {
        "id": 29,
        "text": "الانيا",
        "lat": 36.5436,
        "lng": 31.9997
    },
    {
        "id": 30,
        "text": "أديامان",
        "lat": 37.7644,
        "lng": 38.2763
    },
    {
        "id": 31,
        "text": "أفيون قره حصار",
        "lat": 38.7581,
        "lng": 30.5386
    },
    {
        "id": 32,
        "text": "اسكندرون",
        "lat": 36.5804,
        "lng": 36.17
    },
    {
        "id": 33,
        "text": "اكسراي",
        "lat": 38.3686,
        "lng": 34.0297
    },
    {
        "id": 34,
        "text": "Çorum",
        "lat": 40.5489,
        "lng": 34.9533
    },
    {
        "id": 35,
        "text": "İnegöl",
        "lat": 40.0806,
        "lng": 29.5097
    },
    {
        "id": 36,
        "text": "Kütahya",
        "lat": 39.4242,
        "lng": 29.9833
    },
    {
        "id": 37,
        "text": "عثمانية",
        "lat": 37.075,
        "lng": 36.25
    },
    {
        "id": 38,
        "text": "Çorlu",
        "lat": 41.1597,
        "lng": 27.8028
    },
    {
        "id": 39,
        "text": "سكاريا",
        "lat": 40.7778,
        "lng": 30.4028
    },
    {
        "id": 40,
        "text": "اسبارتا",
        "lat": 37.7667,
        "lng": 30.55
    },
    {
        "id": 41,
        "text": "Kızıltepe",
        "lat": 37.1939,
        "lng": 40.5861
    },
    {
        "id": 42,
        "text": "Uşak",
        "lat": 38.6833,
        "lng": 29.4
    },
    {
        "id": 43,
        "text": "مانيسا",
        "lat": 38.6131,
        "lng": 27.4258
    },
    {
        "id": 44,
        "text": "Düzce",
        "lat": 40.8417,
        "lng": 31.1583
    },
    {
        "id": 45,
        "text": "Niğde",
        "lat": 37.9667,
        "lng": 34.6792
    },
    {
        "id": 46,
        "text": "Bolu",
        "lat": 40.7333,
        "lng": 31.6
    },
    {
        "id": 47,
        "text": "Tokat",
        "lat": 40.3097,
        "lng": 36.5542
    },
    {
        "id": 48,
        "text": "Kırıkkale",
        "lat": 39.8417,
        "lng": 33.5139
    },
    {
        "id": 49,
        "text": "Viranşehir",
        "lat": 37.2306,
        "lng": 39.7653
    },
    {
        "id": 50,
        "text": "Karaman",
        "lat": 37.1833,
        "lng": 33.2167
    },
    {
        "id": 51,
        "text": "Muş",
        "lat": 38.7333,
        "lng": 41.4911
    },
    {
        "id": 52,
        "text": "ايدن",
        "lat": 37.8481,
        "lng": 27.8453
    },
    {
        "id": 53,
        "text": "Çanakkale",
        "lat": 40.15,
        "lng": 26.4
    },
    {
        "id": 54,
        "text": "Edirne",
        "lat": 41.6781,
        "lng": 26.5594
    },
    {
        "id": 55,
        "text": "Torbalı",
        "lat": 38.1619,
        "lng": 27.3583
    },
    {
        "id": 56,
        "text": "Ereğli",
        "lat": 41.2583,
        "lng": 31.425
    },
    {
        "id": 57,
        "text": "Menemen",
        "lat": 38.6,
        "lng": 27.0667
    },
    {
        "id": 58,
        "text": "سيرت",
        "lat": 37.8417,
        "lng": 41.9458
    },
    {
        "id": 59,
        "text": "Körfez",
        "lat": 40.7706,
        "lng": 29.7661
    },
    {
        "id": 60,
        "text": "Turgutlu",
        "lat": 38.5,
        "lng": 27.7
    },
    {
        "id": 61,
        "text": "Gölcük",
        "lat": 40.6667,
        "lng": 29.8333
    },
    {
        "id": 62,
        "text": "Salihli",
        "lat": 38.4811,
        "lng": 28.1392
    },
    {
        "id": 63,
        "text": "Bingöl",
        "lat": 38.8861,
        "lng": 40.5017
    },
    {
        "id": 64,
        "text": "Fethiye",
        "lat": 36.6206,
        "lng": 29.1142
    },
    {
        "id": 65,
        "text": "Talas",
        "lat": 38.6833,
        "lng": 35.5667
    },
    {
        "id": 66,
        "text": "Erzincan",
        "lat": 39.7464,
        "lng": 39.4914
    },
    {
        "id": 67,
        "text": "Zonguldak",
        "lat": 41.4304,
        "lng": 31.78
    },
    {
        "id": 68,
        "text": "Nazilli",
        "lat": 37.9125,
        "lng": 28.3206
    },
    {
        "id": 69,
        "text": "Ordu",
        "lat": 40.9833,
        "lng": 37.8833
    },
    {
        "id": 70,
        "text": "Bartın",
        "lat": 41.6344,
        "lng": 32.3375
    },
    {
        "id": 71,
        "text": "Bandırma",
        "lat": 40.3542,
        "lng": 27.9725
    },
    {
        "id": 72,
        "text": "Kırşehir",
        "lat": 39.145,
        "lng": 34.1608
    },
    {
        "id": 73,
        "text": "Ağrı",
        "lat": 39.7225,
        "lng": 43.0544
    },
    {
        "id": 74,
        "text": "Amasya",
        "lat": 40.65,
        "lng": 35.8333
    },
    {
        "id": 75,
        "text": "Kastamonu",
        "lat": 41.3833,
        "lng": 33.7833
    },
    {
        "id": 76,
        "text": "Lüleburgaz",
        "lat": 41.4056,
        "lng": 27.3569
    },
    {
        "id": 77,
        "text": "Ereğli",
        "lat": 37.5058,
        "lng": 34.0517
    },
    {
        "id": 78,
        "text": "Yalova",
        "lat": 40.6556,
        "lng": 29.275
    },
    {
        "id": 79,
        "text": "Nevşehir",
        "lat": 38.625,
        "lng": 34.7122
    },
    {
        "id": 80,
        "text": "Cizre",
        "lat": 37.325,
        "lng": 42.1958
    },
    {
        "id": 81,
        "text": "Nizip",
        "lat": 37.0104,
        "lng": 37.7985
    },
    {
        "id": 82,
        "text": "Rize",
        "lat": 41.0167,
        "lng": 40.5167
    },
    {
        "id": 83,
        "text": "Iğdır",
        "lat": 39.9167,
        "lng": 44.0333
    },
    {
        "id": 84,
        "text": "Giresun",
        "lat": 40.9,
        "lng": 38.4167
    },
    {
        "id": 85,
        "text": "Ödemiş",
        "lat": 38.2311,
        "lng": 27.9719
    },
    {
        "id": 86,
        "text": "Karabük",
        "lat": 41.2,
        "lng": 32.6333
    },
    {
        "id": 87,
        "text": "Kozan",
        "lat": 37.4507,
        "lng": 35.8123
    },
    {
        "id": 88,
        "text": "Çayırova",
        "lat": 40.8265,
        "lng": 29.3745
    },
    {
        "id": 89,
        "text": "Ünye",
        "lat": 41.1271,
        "lng": 37.2882
    },
    {
        "id": 90,
        "text": "Polatlı",
        "lat": 39.5842,
        "lng": 32.1472
    },
    {
        "id": 91,
        "text": "Kadirli",
        "lat": 37.3739,
        "lng": 36.0961
    },
    {
        "id": 92,
        "text": "Patnos",
        "lat": 39.2358,
        "lng": 42.8686
    },
    {
        "id": 93,
        "text": "Doğubayazıt",
        "lat": 39.55,
        "lng": 44.0833
    },
    {
        "id": 94,
        "text": "Samandağ",
        "lat": 36.085,
        "lng": 35.9806
    },
    {
        "id": 95,
        "text": "Kapaklı",
        "lat": 41.3333,
        "lng": 27.9667
    },
    {
        "id": 96,
        "text": "Kilis",
        "lat": 36.7167,
        "lng": 37.1167
    },
    {
        "id": 97,
        "text": "Kuşadası",
        "lat": 37.8586,
        "lng": 27.2594
    },
    {
        "id": 98,
        "text": "Akçakale",
        "lat": 36.7108,
        "lng": 38.9478
    },
    {
        "id": 99,
        "text": "Burdur",
        "lat": 37.7167,
        "lng": 30.2833
    },
    {
        "id": 100,
        "text": "Kars",
        "lat": 40.6069,
        "lng": 43.0931
    }

]